/* Todos

1. Add their images

NOTE: If you're seeing this, I know the errors are there. The final product will not have the errors.

*/

[
  {
    "id": 1,
    "name": "Hank Aaron",
    "description": "Henry Louis Aaron , nicknamed \"Hammer\" or \"Hammerin' Hank\", was an American professional baseball right fielder who played 23 seasons in Major League Baseball (MLB), from 1954 through 1976. He spent 21 seasons with the Milwaukee/Atlanta Braves in the National League (NL) and two seasons with the Milwaukee Brewers in the American League (AL).",
    "dob": "February 5, 1934",
    "died": "January 22, 2021",
    "age": 86,
    "knownFor": "Baseball"
  },
  {
    "id": 2,
    "name": "Ira Aldridge",
    "description": "Ira Frederick Aldridge was an American and later British actor and playwright who made his career after 1824 largely on the London stage and in Europe, especially in Shakespearean roles. Born in New York City, Aldridge is the only actor of African-American descent among the thirty-three actors of the English stage honoured with bronze plaques at the Shakespeare Memorial Theatre at Stratford-upon-Avon.",
    "dob": "July 24, 1807",
    "died": "August 7, 1867",
    "age": 60,
    "knownFor": "Actor and playwright"
  },
  {
    "id": 3,
    "name": "Muhammad Ali",
    "description": "Muhammad Ali, born Cassius Marcellus Clay Jr. was an American professional boxer, activist, entertainer and philanthropist. Nicknamed The Greatest, he is widely regarded as one of the most significant and celebrated figures of the 20th century and as one of the greatest boxers of all time.",
    "dob": "January 17, 1942",
    "died": "June 3, 2016",
    "age": 74,
    "knownFor": "Boxing"
  },
  {
    "id": 4,
    "name": "Richard Allen (bishop)",
    "description": "Richard Allen was a minister, educator, writer, and one of America's most active and influential Black leaders. In 1794, he founded the African Methodist Episcopal Church (AME), the first independent Black denomination in the United States. He opened his first AME church in 1794 in Philadelphia, Pennsylvania.",
    "dob": "February 14, 1760",
    "died": "March 26, 1831",
    "age": 71,
    "knownFor": "Minister, Educator, Writer"
  },
  {
    "id": 5,
    "name": "Marian Anderson",
    "description": "Marian Anderson was an American contralto. She performed a wide range of music, from opera to spirituals. Anderson performed with renowned orchestras in major concert and recital venues throughout the United States and Europe between 1925 and 1965.",
    "dob": "February 27, 1897",
    "died": "April 8, 1993",
    "age": 94,
    "knownFor": "Contralto"
  },
  {
    "id": 6,
    "name": "Maya Angelou",
    "description": "Maya Angelou, born Marguerite Annie Johnson, was an American poet, memoirist, and civil rights activist. She published seven autobiographies, three books of essays, several books of poetry, and is credited with a list of plays, movies, and television shows spanning over 50 years. She received dozens of awards and more than 50 honorary degrees. Angelou is best known for her series of seven autobiographies, which focus on her childhood and early adult experiences. The first, I Know Why the Caged Bird Sings (1969), tells of her life up to the age of 17 and brought her international recognition and acclaim.",
    "dob": "April 4, 1928",
    "died": "May 28, 2014",
    "age": 86,
    "knownFor": "Poet, Memoirist, Civil rights activist"
  },
  {
    "id": 7,
    "name": "Arthur Ashe",
    "description": "Arthur Robert Ashe Jr. was an American professional tennis player who won three Grand Slam singles titles. He was the first black player selected to the United States Davis Cup team and the only black man ever to win the singles title at Wimbledon, the US Open, and the Australian Open. He retired in 1980.",
    "dob": "July 10, 1943",
    "died": "February 6, 1993",
    "age": 49,
    "knownFor": "Tennis"
  },
  {
    "id": 8,
    "name": "Crispus Attucks",
    "description": "Crispus Attucks was an American stevedore of African and Native American descent, widely regarded as the first person killed in the Boston Massacre and thus the first American killed in the American Revolution.",
    "dob": "c.1723",
    "died": "March 5, 1770",
    "age": 49,
    "knownFor": "Stevedore"
  },
  {
    "id": 9,
    "name": "James Arthur Baldwin",
    "description": "James Arthur Baldwin was an American novelist, playwright, essayist, poet, and activist. His essays, collected in Notes of a Native Son (1955), explore intricacies of racial, sexual, and class distinctions in the Western society of the United States during the mid twentieth-century.",
    "dob": "August 2, 1924",
    "died": "December 1, 1987",
    "age": 63,
    "knownFor": "Novelist, Playwright, Essayist, Poet, Activist"
  },
  {
    "id": 10,
    "name": "Benjamin Banneker",
    "description": "Benjamin Banneker was a free African-American almanac author, surveyor, landowner and farmer who had knowledge of mathematics and natural history. Born in Baltimore County, Maryland, to a free African-American woman and a former slave, Banneker had little or no formal education and was largely self-taught. He became known for assisting Major Andrew Ellicott in a survey that established the original borders of the District of Columbia, the federal capital district of the United States.",
    "dob": "November 9, 1731",
    "died": "October 19, 1806",
    "age": 74,
    "knownFor": "Almanac author, surveyor, landowner, farmer"
  },
  {
    "id": 11,
    "name": "Amiri Baraka",
    "description": "Amiri Baraka (born Everett LeRoi Jones ), previously known as LeRoi Jones and Imamu Amear Baraka, was an American writer of poetry, drama, fiction, essays and music criticism. He was the author of numerous books of poetry and taught at several universities, including the University at Buffalo and Stony Brook University. He received the PEN/Beyond Margins Award in 2008 for Tales of the Out and the Gone.",
    "dob": "October 7, 1934",
    "died": "January 9, 2014",
    "age": 79,
    "knownFor": "Actor, teacher, theater director, theater producer, writer, activist, poet"
  },
  {
    "id": 12,
    "name": "Romare Bearden",
    "description": "Romare Bearden was an American artist, author, and songwriter. He worked with many types of media including cartoons, oils, and collages. Born in Charlotte, North Carolina, Bearden grew up in New York City and Pittsburgh, Pennsylvania, and graduated from New York University in 1935.",
    "dob": "September 2, 1911",
    "died": "March 12, 1988",
    "age": 76,
    "knownFor": "Artist, author, songwriter"
  },
  {
    "id": 13,
    "name": "Mary McLeod Bethune",
    "description": "Mary Jane McLeod Bethune (born Mary Jane McLeod) was an American educator, stateswoman, philanthropist, humanitarian, womanist, and civil rights activist. Bethune founded the National Council for Negro Women in 1935, established the organization's flagship journal Aframerican Women's Journal, and resided as president or leader for myriad African American women's organizations including the National Association for Colored Women and the National Youth Administration's Negro Division",
    "dob": "July 10, 1875",
    "died": "May 18, 1955",
    "age": 79,
    "knownFor": "Educator, stateswoman, philanthropist, humanitarian, womanist, civil rights activist"
  },
  {
    "id": 14,
    "name": "Guion Bluford",
    "description": "Guion Stewart Bluford Jr. is an American aerospace engineer, retired U.S. Air Force officer and fighter pilot, and former NASA astronaut, who is the first African American and the second person of African descent to go to space. Before becoming an astronaut, he was an officer in the U.S. Air Force, where he remained while assigned to NASA, rising to the rank of colonel. He participated in four Space Shuttle flights between 1983 and 1992. In 1983, as a member of the crew of the Orbiter Challenger on the mission STS-8, he became the first African American in space as well as the second person of African ancestry in space, after Cuban cosmonaut Arnaldo Tamayo Méndez.",
    "dob": "November 22, 1942",
    "died": "Alive",
    "age": 78,
    "knownFor": "Engineer, Fighter Pilot, Astronaut"
  },
  {
    "id": 15,
    "name": "Arna Bontemps",
    "description": "Arna Wendell Bontemps was an American poet, novelist and librarian, and a noted member of the Harlem Renaissance.",
    "dob": "October 13, 1902",
    "died": "June 4, 1973",
    "age": 71,
    "knownFor": "Poet, novelist, librarian"
  },
  {
    "id": 16,
    "name": "Edward Brooke",
    "description": "Edward William Brooke III was an American Republican politician. In 1966, he became the first African American popularly elected to the United States Senate. He represented Massachusetts in the Senate from 1967 to 1979.",
    "dob": "October 26, 1919",
    "died": "January 3, 2015",
    "age": 95,
    "knownFor": "United States Senator"
  },
  {
    "id": 17,
    "name": "Gwendolyn Brooks",
    "description": "Gwendolyn Elizabeth Brooks was an American poet, author, and teacher. Her work often dealt with the personal celebrations and struggles of ordinary people in her community. She won the Pulitzer Prize for Poetry on May 1, 1950, for Annie Allen, making her the first African American to receive a Pulitzer Prize.",
    "dob": "June 7, 1917",
    "died": "December 3, 2000",
    "age": 70,
    "knownFor": "Poet, author, teacher"
  },
  {
    "id": 18,
    "name": "Blanche Bruce",
    "description": "Blanche Kelso Bruce was born into slavery in Prince Edward County, Virginia and went on to become a politician who represented Mississippi as a Republican in the United States Senate from 1875 to 1881. He was the first elected African-American senator to serve a full term.",
    "dob": "March 1, 1841",
    "died": "March 17, 1898",
    "age": 57,
    "knownFor": "First African-American politician to serve a full term"
  },
  {
    "id": 19,
    "name": "Ralph Bunche",
    "description": "Ralph Johnson Bunche was an American political scientist, academic, and diplomat who received the 1950 Nobel Peace Prize for his late 1940s mediation in Israel. He was the first African American to be so honored. He was involved in the formation and administration of the United Nations and played a major role in numerous peacekeeping operations sponsored by the UN. In 1963, he was awarded the Presidential Medal of Freedom by President John F. Kennedy",
    "dob": "August 7, 1904",
    "died": "December 9, 1971",
    "age": 67,
    "knownFor": "First African American to receive the Nobel Peace Prize"
  },
  {
    "id": 20,
    "name": "George Washington Carver",
    "description": "George Washington Carver was an American agricultural scientist and inventor who promoted alternative crops to cotton and methods to prevent soil depletion. He was the most prominent black scientist of the early 20th century.",
    "dob": "1 January 1864",
    "died": "5 January 1943",
    "age": 79,
    "knownFor": "Scientist"
  },
]

  {
    "id": ,
    "name": "",
    "description": "",
    "dob": "",
    "died": "",
    "age": ,
    "knownFor": ""
  },